app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."goal_id" = ?  [["goal_id", 1]]
---

<% @goal.tasks.each do |task| %>