app/views/welcome/home.html.erb

<ul>
<% current_user.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "goals" ON "categories"."goal_id" = "goals"."id" WHERE "goals"."user_id" = ?  [["user_id", 1]]

<ul>
<% current_user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" INNER JOIN "goals" ON "tasks"."goal_id" = "goals"."id" WHERE "goals"."user_id" = ?  [["user_id", 1]]