app/controllers/goals_controller.rb

  def index
    @goals = Goal.all
---
SELECT "goals".* FROM "goals"

  def create
    @goal = Goal.create(goal_params.merge(user_id: current_user.id))
---
INSERT INTO "goals" ("title", "description", "user_id") VALUES (?, ?, ?)  [["title", "do 10 jumping jacks a day"], ["description", "be stronger"], ["user_id", 1]]

  def update
    @goal.update(goal_params)
---
UPDATE "goals" SET "description" = ? WHERE "goals"."id" = ?  [["description", "beautiful sights, much marble"], ["id", 11]]

  def destroy
    @goal.delete
---
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 2]]

  def set_goal
    @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 11]]