app/controllers/sessions_controller.rb

  def create
    # @user = User.find_or_create_by(uid: auth['uid']) do |u|
    #   u.name = auth['info']['name']
    #   u.email = auth['info']['email']
    #   u.image = auth['info']['image']
    # end

    @user = User.find_or_create_by(uid: auth['uid'])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "10101708514914570"]]