app/controllers/tasks_controller.rb

  def index
    @goal = Goal.find(params[:goal_id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @task = Task.create(task_params.merge(user_id: current_user.id))
---
INSERT INTO "tasks" ("description", "due_date", "goal_id", "user_id") VALUES (?, ?, ?, ?)  [["description", "watch funny show"], ["due_date", "0004-11-18"], ["goal_id", 1], ["user_id", 1]]

  def update
    @task.update(task_params)
---
UPDATE "tasks" SET "description" = ? WHERE "tasks"."id" = ?  [["description", "watch andy griffith"], ["id", 16]]

   def destroy
     @task.delete
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 16]]