app/views/goals/_form.html.erb

SELECT "categories".id FROM "categories" WHERE "categories"."goal_id" = ?  [["goal_id", 8]]
SELECT COUNT(*) FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", ""]]
---
<%= f.text_area :description, size: "24x6" %><br/>
<% if !Category.all.empty? %>
<p><%= f.label "Choose Existing Category" %></p>
<%= f.collection_check_boxes :category_ids, Category.all, :id, :name %>