app/views/goals/new.html.erb

  <p>Description: </p><%= f.text_area :description, size: "24x6" %><br/>
  <p>Choose Existing Category: <%= collection_select(:goal, :category_id, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"