app/views/goals/show.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."goal_id" = ?  [[nil, 2]]
---
<ul>
 <% @goal.categories.each do |category| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."goal_id" = ?  [["goal_id", 1]]
---
<ul>
<% @goal.tasks.each do |task| %>